{
    "experiences": {
        "title": {
            "es": "Experiencia",
            "en": "Experience",
            "pt": "Experiência"
        },
        "view_full_experience_text": {
            "es": "Ver experiencia completa -->",
            "en": "View full experience -->",
            "pt": "Ver experiência completa -->"
        },
        "view_full_experience_href": {
            "es": "/experience",
            "en": "/en/experience",
            "pt": "/pt/experience"
        },
        "experience0": {
            "es":
            {
                "title": "Becario",
                "company": "Indra",
                "companyLink": "https://www.indracompany.com/",
                "companyColor": "#014353",
                "companyColor2": "#ffffff",
                "location": "Torrejón de Ardoz, Madrid",
                "startDate": "2013-01",
                "endDate": "2014-05",
                "description": "Ayuda a project manager en gestión de proyectos. Desarrollo HW y FW.",
                "responsibilities": [
                    "Ayuda a project manager en gestión de proyectos.",
                    "Diseño de pruebas para arranque de PCBs de comunicaciones para controladores aéreos.",
                    "Diseño HW y FW"
                ],
                "keyAccomplishments": [
                    "Diseño y documentación de pruebas de arranque de PCBs de comunicaciones para controladores aéreos.",
                    "Reparación de PCBs para controladores de tráfico aéreo."
                ],
                "technologies": [
                    "Altium", 
                    "C", 
                    "MPLAB"
                ]
            },
            "en": {
                "title": "Intern",
                "company": "Indra",
                "companyLink": "https://www.indracompany.com/",
                "companyColor": "#014353",
                "companyColor2": "#ffffff",
                "location": "Torrejón de Ardoz, Madrid",
                "startDate": "2013-01",
                "endDate": "2014-05",
                "description": "Help project manager in project management. HW and FW development.",
                "responsibilities": [
                    "Help project manager in project management.",
                    "Design tests for starting communications PCBs for air traffic controllers.",
                    "HW and FW design"
                ],
                "keyAccomplishments": [
                    "Design and documentation of tests for starting communications PCBs for air traffic controllers.",
                    "Repair of PCBs for air traffic controllers."
                ],
                "technologies": [
                    "Altium", 
                    "C", 
                    "MPLAB"
                ]
            },
            "pt": {
                "title": "Estagiário",
                "company": "Indra",
                "companyLink": "https://www.indracompany.com/",
                "companyColor": "#014353",
                "companyColor2": "#ffffff",
                "location": "Torrejón de Ardoz, Madrid",
                "startDate": "2013-01",
                "endDate": "2014-05",
                "description": "Ajuda o gerente de projeto na gestão de projetos. Desenvolvimento de HW e FW.",
                "responsibilities": [
                    "Ajuda o gerente de projeto na gestão de projetos.",
                    "Projetar testes para iniciar PCBs de comunicações para controladores de tráfego aéreo.",
                    "Projeto de HW e FW"
                ],
                "keyAccomplishments": [
                    "Projeto e documentação de testes para iniciar PCBs de comunicações para controladores de tráfego aéreo.",
                    "Reparo de PCBs para controladores de tráfego aéreo."
                ],
                "technologies": [
                    "Altium", 
                    "C", 
                    "MPLAB"
                ]
            }
        },
        "experience1": {
            "es":
            {
                "title": "Ingeniero electrónico",
                "company": "Indra",
                "companyLink": "https://www.indracompany.com/",
                "companyColor": "#014353",
                "companyColor2": "#ffffff",
                "location": "Torrejón de Ardoz, Madrid",
                "startDate": "2014-05",
                "endDate": "2017-10",
                "description": "Desarrollo HW y FW.",
                "responsibilities": [
                    "Desarrollo FW de PCB de control de helicóptero autónomo.",
                    "Mantenimiento de HW de PCBs de helicóptero autónomo.",
                    "Desarrollo HW de PCB con sensores para un caza."
                ],
                "keyAccomplishments": [
                    "Nadie quería hacerse cargo del FW de la PCB de control de helicóptero autónomo, lo qye hacía que el proyecto avanzase muy lentamente. Me hice cargo del FW, por lo que el proyecto avanzó mucho más rápido.",
                    "Cuando llegué las pruebas de arranque de las PCBs se hacían a mano, ya que las diseñaban los ingenieros que las diseñaban y solo las probaban en la fase de diseño. Pero cuando el proyecto estaba en producción, cada vez que se fabricaban nuevas PCBs, sus pruebas se hacían muy lentas porque se tenían que hacer a mano. En las PCBs que desarrollé, implementé cableado de pruebas y FW de pruebas, de manera que el test de las PCBs se hacía automáticamente, haciendo que cuando el proyecto estaba en producción, las pruebas de las PCBs se podían hacer mucho más rápido y además las pudiese hacer más gente, porque no hacía falta personal con un cierto conocimiento mínimo"
                ],
                "technologies": ["Altium", "C", "Eclipse"]
            },
            "en": {
                "title": "Electronic Engineer",
                "company": "Indra",
                "companyLink": "https://www.indracompany.com/",
                "companyColor": "#014353",
                "companyColor2": "#ffffff",
                "location": "Torrejón de Ardoz, Madrid",
                "startDate": "2014-05",
                "endDate": "2017-10",
                "description": "HW and FW development.",
                "responsibilities": [
                    "FW development of autonomous helicopter control PCB.",
                    "Maintenance of autonomous helicopter PCB HW.",
                    "HW development of PCB with sensors for a fighter."
                ],
                "keyAccomplishments": [
                    "Nobody wanted to take charge of the FW of the autonomous helicopter control PCB, which made the project progress very slowly. I took charge of the FW, so the project progressed much faster.",
                    "When I arrived, the startup tests of the PCBs were done by hand, since they were designed by the engineers who designed them and only tested them in the design phase. But when the project was in production, every time new PCBs were manufactured, their tests were very slow because they had to be done by hand. In the PCBs I developed, I implemented test wiring and test FW, so that the test of the PCBs was done automatically, making that when the project was in production, the tests of the PCBs could be done much faster and also could be done by more people, because it was not necessary to have personnel with a certain minimum knowledge."
                ],
                "technologies": ["Altium", "C", "Eclipse"]
            },
            "pt": {
                "title": "Engenheiro eletrônico",
                "company": "Indra",
                "companyColor2": "#ffffff",
                "companyLink": "https://www.indracompany.com/",
                "companyColor": "#014353",
                "location": "Torrejón de Ardoz, Madrid",
                "startDate": "2014-05",
                "endDate": "2017-10",
                "description": "Desenvolvimento de HW e FW.",
                "responsibilities": [
                    "Desenvolvimento de FW de PCB de controle de helicóptero autônomo.",
                    "Manutenção de HW de PCBs de helicóptero autônomo.",
                    "Desenvolvimento de HW de PCB com sensores para um caça."
                ],
                "keyAccomplishments": [
                    "Ninguém queria se responsabilizar pelo FW da PCB de controle de helicóptero autônomo, o que fazia com que o projeto progredisse muito lentamente. Assumi o FW, então o projeto progrediu muito mais rápido.",
                    "Quando cheguei, os testes de inicialização das PCBs eram feitos manualmente, pois eram projetados pelos engenheiros que as projetavam e apenas as testavam na fase de projeto. Mas quando o projeto estava em produção, toda vez que novas PCBs eram fabricadas, seus testes eram muito lentos porque tinham que ser feitos manualmente. Nas PCBs que desenvolvi, implementei cabeamento de teste e FW de teste, de modo que o teste das PCBs era feito automaticamente, fazendo com que quando o projeto estava em produção, os testes das PCBs pudessem ser feitos muito mais rapidamente e também poderiam ser feitos por mais pessoas, porque não era necessário ter pessoal com um conhecimento mínimo."
                ],
                "technologies": ["Altium", "C", "Eclipse"]
            }
        },
        "experience2": {
            "es": {
                "title": "Ingeniero de IA y electrónico",
                "company": "Arquimea",
                "companyLink": "https://www.arquimea.com/",
                "companyColor": "#7ff9d3",
                "companyColor2": "#6b7880",
                "location": "Leganés, Madrid",
                "startDate": "2017-10",
                "endDate": "2022-07",
                "description": "Desarrollo de IA, HW y FW.",
                "responsibilities": [
                    "Implementación de algoritmos de detección para UAV.",
                    "Desarrollo de piloto de algoritmo de geoposicionamiento sin GPS.",
                    "Liderazgo del desarrollo de HW y FW de UAV."
                ],
                "keyAccomplishments": [
                    "Con la implementación de algoritmos de detección para UAV, evitamos tener que comprar un dispositivo que hacía dicha detección, ahorrando un coste de 2000€ por unidad.",
                    "Cuando llegué el HW y FW de cada uno de los UAVs y estaciones de tierra era diferente, lo que hacía que hubiese varios equipos desarrollando la misma funcionalidad, de diferentes maneras. Unifiqué el HW de los UAVs y estaciones de tierra, lo que abarataba las fabricaciones de PCBs. Además permitió crear un FW de bajo nivel común, teniendo que cambiar solo la parte de alto nivel, evitando desarrollos duplicados.",
                    "En entornos de guerra electrónica, es común inhabilitar el GPS, lo que es letal para los UAVs, ya que no pueden geoposicionarse. Con el piloto de algoritmo de geoposicionamiento sin GPS, conseguimos tener una ventaja competitiva contra nuestros competidores."
                ],
                "technologies": [
                    "Python",
                    "Pytorch",
                    "YOLO",
                    "Altium",
                    "STM32",
                    "C"
                ]
            },
            "en": {
                "title": "AI and electronic engineer",
                "company": "Arquimea",
                "companyLink": "https://www.arquimea.com/",
                "companyColor": "#7ff9d3",
                "companyColor2": "#6b7880",
                "location": "Leganés, Madrid",
                "startDate": "2017-10",
                "endDate": "2022-07",
                "description": "AI, HW and FW development.",
                "responsibilities": [
                    "Implementation of detection algorithms for UAV.",
                    "Development of a pilot algorithm for geopositioning without GPS.",
                    "Leadership of UAV HW and FW development."
                ],
                "keyAccomplishments": [
                    "With the implementation of detection algorithms for UAV, we avoided having to buy a device that did such detection, saving a cost of €2000 per unit.",
                    "When I arrived, the HW and FW of each of the UAVs and ground stations was different, which meant that there were several teams developing the same functionality, in different ways. I unified the HW of the UAVs and ground stations, which reduced the cost of PCB manufacturing. It also allowed to create a common low-level FW, having to change only the high-level part, avoiding duplicate developments.",
                    "In electronic warfare environments, it is common to disable the GPS, which is lethal for UAVs, as they cannot geoposition. With the pilot algorithm for geopositioning without GPS, we managed to have a competitive advantage against our competitors."
                ],
                "technologies": [
                    "Python",
                    "Pytorch",
                    "YOLO",
                    "Altium",
                    "STM32",
                    "C"
                ]
            },
            "pt": {
                "title": "Engenheiro de IA e eletrônico",
                "company": "Arquimea",
                "companyLink": "https://www.arquimea.com/",
                "companyColor": "#7ff9d3",
                "companyColor2": "#6b7880",
                "location": "Leganés, Madrid",
                "startDate": "2017-10",
                "endDate": "2022-07",
                "description": "Desenvolvimento de IA, HW e FW.",
                "responsibilities": [
                    "Implementação de algoritmos de detecção para UAV.",
                    "Desenvolvimento de um algoritmo piloto para geoposicionamento sem GPS.",
                    "Liderança do desenvolvimento de HW e FW de UAV."
                ],
                "keyAccomplishments": [
                    "Com a implementação de algoritmos de detecção para UAV, evitamos ter que comprar um dispositivo que fazia tal detecção, economizando um custo de 2000€ por unidade.",
                    "Quando cheguei, o HW e FW de cada um dos UAVs e estações terrestres era diferente, o que significava que havia várias equipes desenvolvendo a mesma funcionalidade, de maneiras diferentes. Unifiquei o HW dos UAVs e estações terrestres, o que reduziu o custo de fabricação de PCBs. Também permitiu criar um FW de baixo nível comum, tendo que mudar apenas a parte de alto nível, evitando desenvolvimentos duplicados.",
                    "Em ambientes de guerra eletrônica, é comum desativar o GPS, o que é letal para os UAVs, pois não podem se geoposicionar. Com o algoritmo piloto para geoposicionamento sem GPS, conseguimos ter uma vantagem competitiva contra nossos concorrentes."
                ],
                "technologies": [
                    "Python",
                    "Pytorch",
                    "YOLO",
                    "Altium",
                    "STM32",
                    "C"
                ]
            }
        },
        "experience3": {
            "es": {
                "title": "Machine Learning Engineer",
                "company": "Sener",
                "companyLink": "https://www.group.sener/",
                "companyColor": "#004179",
                "companyColor2": "#ffffff",
                "location": "Tres Cantos, Madrid",
                "startDate": "2022-09",
                "endDate": "2024-09",
                "description": "Machine Learning Engineer, desarrollo de algoritmos de vision para vehículo autónomo y liderazgo en sistema de RAG para obtener información de documentación",
                "responsibilities": [
                    "Desarrollo del conjunto de algoritmos de visión para vehículo autónomo.",
                    "Liderazgo en el desarrollo de sistema de RAG para obtener información de documentación."
                ],
                "keyAccomplishments": [
                    "Al trabajar en un vehículo autónomo todo tiene que ir en un dispositivo embebido, que no es tan potente como un ordenador normal. Por lo que optimicé las redes neuronales con TensorRT, consiguiendo que el tiempo de inferencia y la memoria VRAM necesaria fuese mucho menor, asegurando el funcionamiento en tiempo real del vehículo autónomo.",
                    "Desarrollo de un dataset de imágenes sintéticas realistas para entrenar las redes para el vehículo autónomo, creando imágenes en diferentes condiciones ambientales, haciendo que las redes neuronales fuesen más robustas.",
                    "Implementación de scripts de arranque de todas las librerías y programas del dispositivo del vehículo autónomo. Antes solo sabía instalar todo una persona, ahora cualquiera puede arrancar el sistema.",
                    "Impulsar la promoción de una compañera",
                    "Mentorización de becarios y juniors"
                ],
                "technologies": [
                    "Python",
                    "Pytorch",
                    "HuggingFace",
                    "TensorRT",
                    "Nvidia Jetson"
                ]
            },
            "en": {
                "title": "Machine Learning Engineer",
                "company": "Sener",
                "companyLink": "https://www.group.sener/",
                "companyColor": "#004179",
                "companyColor2": "#ffffff",
                "location": "Tres Cantos, Madrid",
                "startDate": "2022-09",
                "endDate": "2024-09",
                "description": "Machine Learning Engineer, vision algorithms development for autonomous vehicle and leadership in RAG system to obtain documentation information",
                "responsibilities": [
                    "Development of the set of vision algorithms for autonomous vehicle.",
                    "Leadership in the development of RAG system to obtain documentation information."
                ],
                "keyAccomplishments": [
                    "When working on an autonomous vehicle everything has to go on an embedded device, which is not as powerful as a normal computer. So I optimized the neural networks with TensorRT, making the inference time and the necessary VRAM memory much lower, ensuring the real-time operation of the autonomous vehicle.",
                    "Development of a dataset of realistic synthetic images to train the networks for the autonomous vehicle, creating images in different environmental conditions, making the neural networks more robust.",
                    "Implementation of startup scripts for all the libraries and programs of the autonomous vehicle device. Before only one person knew how to install everything, now anyone can start the system.",
                    "Promotion of a colleague",
                    "Mentoring of interns and juniors"
                ],
                "technologies": [
                    "Python",
                    "Pytorch",
                    "HuggingFace",
                    "TensorRT",
                    "Nvidia Jetson"
                ]
            },
            "pt": {
                "title": "Machine Learning Engineer",
                "company": "Sener",
                "companyLink": "https://www.group.sener/",
                "companyColor": "#004179",
                "companyColor2": "#ffffff",
                "location": "Tres Cantos, Madrid",
                "startDate": "2022-09",
                "endDate": "2024-09",
                "description": "Machine Learning Engineer, desenvolvimento de algoritmos de visão para veículo autônomo e liderança no sistema RAG para obter informações de documentação",
                "responsibilities": [
                    "Desenvolvimento do conjunto de algoritmos de visão para veículo autônomo.",
                    "Liderança no desenvolvimento do sistema RAG para obter informações de documentação."
                ],
                "keyAccomplishments": [
                    "Ao trabalhar em um veículo autônomo, tudo tem que ir em um dispositivo embarcado, que não é tão potente quanto um computador normal. Portanto, otimizei as redes neurais com TensorRT, fazendo com que o tempo de inferência e a memória VRAM necessária fossem muito menores, garantindo o funcionamento em tempo real do veículo autônomo.",
                    "Desenvolvimento de um conjunto de dados de imagens sintéticas realistas para treinar as redes para o veículo autônomo, criando imagens em diferentes condições ambientais, tornando as redes neurais mais robustas.",
                    "Implementação de scripts de inicialização para todas as bibliotecas e programas do dispositivo do veículo autônomo. Antes, apenas uma pessoa sabia instalar tudo, agora qualquer pessoa pode iniciar o sistema.",
                    "Promoção de uma colega",
                    "Mentoria de estagiários e juniores"
                ],
                "technologies": [
                    "Python",
                    "Pytorch",
                    "HuggingFace",
                    "TensorRT",
                    "Nvidia Jetson"
                ]
            }
        },
        "experience4": {
            "es": {
                "title": "AI tech lead",
                "company": "Bravent",
                "companyLink": "https://www.bravent.net/",
                "companyColor": "#d9dd02",
                "companyColor2": "#020725",
                "location": "Remote",
                "startDate": "2024-09",
                "endDate": "2024-12",
                "description": "AI Tech lead. Liderazgo técnico, supervisión de desarrollo y colaboración en la correcta gestión de proyectos. Propuesta de nuevas soluciones.",
                "responsibilities": [
                    "Liderazgo técnico.",
                    "Toma de decisiones técnicas: tecnologías apropiadas.",
                    "Propuesta de nuevas soluciones en el área/innovación.",
                    "Desarrollar SW con estándares establecidos, alta complejidad, plazos cortos.",
                    "Supervisión de desarrollo.",
                    "Colaboración en la correcta gestión de proyectos técnicos.",
                    "Evaluación de riesgos técnicos.",
                    "Ayudar en la resolución de problemas técnicos.",
                    "Comunicación clara y efectiva.",
                    "Mantenerse al día con las últimas tecnologías y tendencias en el campo."
                ],
                "keyAccomplishments": [
                    "Hacer ver que no hace falta usar Chat GPT para todo.."
                ],
                "technologies": [
                    "Python",
                    "Pytorch",
                    "HuggingFace",
                    "Azure",
                    "Azure Machine Learning"
                ]
            },
            "en": {
                "title": "AI tech lead",
                "company": "Bravent",
                "companyLink": "https://www.bravent.net/",
                "companyColor": "#d9dd02",
                "companyColor2": "#020725",
                "location": "Remote",
                "startDate": "2024-09",
                "endDate": "2024-12",
                "description": "AI Tech lead. Technical leadership, development supervision and collaboration in the correct management of technical projects. Proposal of new solutions.",
                "responsibilities": [
                    "Technical Leadership.",
                    "Technical Decision Making: appropriate technologies.",
                    "Propose new solutions in the area/innovation.",
                    "Develop SW established standards, high complexity, short deadlines.",
                    "Development Supervision.",
                    "Collaboration for the correct management of technical projects.",
                    "Technical Risk Assessment",
                    "Assist in the resolution of technical issues.",
                    "Clear and effective communication",
                    "Keeping up to date with the latest technologies and trends in the field"
                ],
                "keyAccomplishments": [
                    "Show that it is not necessary to use Chat GPT for everything."
                ],
                "technologies": [
                    "Python",
                    "Pytorch",
                    "HuggingFace",
                    "Azure"
                ]
            },
            "pt": {
                "title": "AI tech lead",
                "company": "Bravent",
                "companyLink": "https://www.bravent.net/",
                "companyColor": "#d9dd02",
                "companyColor2": "#020725",
                "location": "Remote",
                "startDate": "2024-09",
                "endDate": "2024-12",
                "description": "AI Tech lead. Liderança técnica, supervisão de desenvolvimento e colaboração na gestão correta de projetos técnicos. Proposta de novas soluções.",
                "responsibilities": [
                    "Liderança técnica.",
                    "Tomada de decisões técnicas: tecnologias apropriadas.",
                    "Propor novas soluções na área/inovação.",
                    "Desenvolver SW com padrões estabelecidos, alta complexidade, prazos curtos.",
                    "Supervisão de desenvolvimento.",
                    "Colaboração na gestão correta de projetos técnicos.",
                    "Avaliação de riscos técnicos",
                    "Auxiliar na resolução de problemas técnicos.",
                    "Comunicação clara e eficaz",
                    "Manter-se atualizado com as últimas tecnologias e tendências do campo"
                ],
                "keyAccomplishments": [
                    "Mostrando que no hace falta usar Chat GPT para todo."
                ],
                "technologies": [
                    "Python",
                    "Pytorch",
                    "HuggingFace",
                    "Azure"
                ]
            }
        },
        "experience5": {
            "es": {
                "title": "Machine Learning Engineer - Freelance",
                "company": "Civir",
                "companyLink": "https://civir.es/",
                "companyColor": "#d9dd02",
                "companyColor2": "#020725",
                "location": "Remote",
                "startDate": "2024-01",
                "endDate": "actualidad",
                "description": "Desarrollo de chatbot para HoReCa (hoteles, restaurantes y cafeterías), mediante el cual cocineros y camareros pueden hablar con el chatbot para hacer consultas sobre las recetas y las cartas.",
                "responsibilities": [
                    "Desarrollo de backend con chatbot",
                    "Desarrollo RAG",
                    "Implementación de agentes que obtienen la intención del usuario y ejecutan acciones",
                    "Desarrollo de componentes de React para la interfaz de usuario",
                    "Implementación de chatbot mediante comunicación hablada"
                ],
                "keyAccomplishments": [
                    "Busquedas vectoriales customizables",
                    "Generación de prompts mediante Langchain mediante LangChain que con información de la pregunta del usuario e información de la empresa mediante variables"
                ],
                "technologies": [
                    "Python",
                    "LangChain",
                    "PostgreSQL",
                    "PGVector",
                    "React",
                    "Kubernetes",
                    "Docker",
                    "GitHub Actions"
                ]
            },
            "en": {
                "title": "Machine Learning Engineer - Freelance",
                "company": "Civir",
                "companyLink": "https://civir.es/",
                "companyColor": "#d9dd02",
                "companyColor2": "#020725",
                "location": "Remote",
                "startDate": "2024-01",
                "endDate": "actuality",
                "description": "Development of a chatbot for HoReCa (hotels, restaurants and cafes), through which cooks and waiters can talk to the chatbot to make queries about recipes and menus.",
                "responsibilities": [
                    "Backend development with chatbot",
                    "RAG development",
                    "Implementation of agents that obtain the user's intention and execute actions",
                    "Development of React components for the user interface",
                    "Implementation of chatbot through spoken communication"
                ],
                "keyAccomplishments": [
                    "Customizable vector searches",
                    "Prompt generation using Langchain with LangChain, with information from the user's question and company information through variables"
                ],
                "technologies": [
                    "Python",
                    "LangChain",
                    "PostgreSQL",
                    "PGVector",
                    "React",
                    "Kubernetes",
                    "Docker",
                    "GitHub Actions"
                ]
            },
            "pt": {
                "title": "Engenheiro de Machine Learning - Freelance",
                "company": "Civir",
                "companyLink": "https://civir.es/",
                "companyColor": "#d9dd02",
                "companyColor2": "#020725",
                "location": "Remote",
                "startDate": "2024-01",
                "endDate": "atualidade",
                "description": "Desenvolvimento de um chatbot para HoReCa (hotéis, restaurantes e cafés), através do qual cozinheiros e garçons podem falar com o chatbot para fazer consultas sobre receitas e menus.",
                "responsibilities": [
                    "Desenvolvimento de backend com chatbot",
                    "Desenvolvimento RAG",
                    "Implementação de agentes que obtêm a intenção do usuário e executam ações",
                    "Desenvolvimento de componentes de React para a interface de usuário",
                    "Implementação de chatbot através de comunicação falada"
                ],
                "keyAccomplishments": [
                    "Buscas vectoriais customizáveis",
                    "Geração de prompts usando Langchain com LangChain, com informação da pergunta do usuário e informação da empresa através de variáveis"
                ],
                "technologies": [
                    "Python",
                    "LangChain",
                    "PostgreSQL",
                    "PGVector",
                    "React",
                    "Kubernetes",
                    "Docker",
                    "GitHub Actions"
                ]
            }
        }
    }
}