{
    "posts": {
        "title": {
            "es": "Posts",
            "en": "Posts",
            "pt": "Posts"
        },
        "view_last_posts": {
            "es": "칔ltimos posts -->",
            "en": "Last posts -->",
            "pt": "칔ltimos posts -->"
        },
        "post1": {
            "title": {
                "es": "Post3",
                "en": "Post3",
                "pt": "Post3"
            },
            "description": {
                "es": "Descripci칩n del post3",
                "en": "Post3 description",
                "pt": "Descri칞칚o do post3"
            },
            "image_path": {
                "es": "/images/subtify_logo-scaled.webp",
                "en": "/images/subtify_logo-scaled.webp",
                "pt": "/images/subtify_logo-scaled.webp"
            },
            "image_hover_path": {
                "es": "/images/subtify_result.webp",
                "en": "/images/subtify_result.webp",
                "pt": "/images/subtify_result.webp"
            },
            "post_link": {
                "es": "/post3",
                "en": "/en/post3",
                "pt": "/pt-br/post3"
            }
        },
        "post2": {
            "title": {
                "es": "Test",
                "en": "Test",
                "pt": "Test"
            },
            "description": {
                "es": "Esta es una descripci칩n de prueba. Quiero escribir una descripci칩n muy larga para ver c칩mo se ve en la p치gina. As칤 que estoy escribiendo mucho texto para ver c칩mo se ve en la p치gina. Espero que todo esto se vea bien. Necesito aun m치s texto, as칤 que sigamos escribiendo. No se me ocurren m치s cosas para escribir. As칤 que esto es todo por ahora. Esta es una descripci칩n de prueba. Quiero escribir una descripci칩n muy larga para ver c칩mo se ve en la p치gina. As칤 que estoy escribiendo mucho texto para ver c칩mo se ve en la p치gina. Espero que todo esto se vea bien. Necesito aun m치s texto, as칤 que sigamos escribiendo. No se me ocurren m치s cosas para escribir. As칤 que esto es todo por ahora. Esta es una descripci칩n de prueba. Quiero escribir una descripci칩n muy larga para ver c칩mo se ve en la p치gina. As칤 que estoy escribiendo mucho texto para ver c칩mo se ve en la p치gina. Espero que todo esto se vea bien. Necesito aun m치s texto, as칤 que sigamos escribiendo. No se me ocurren m치s cosas para escribir. As칤 que esto es todo por ahora. Esta es una descripci칩n de prueba. Quiero escribir una descripci칩n muy larga para ver c칩mo se ve en la p치gina. As칤 que estoy escribiendo mucho texto para ver c칩mo se ve en la p치gina. Espero que todo esto se vea bien. Necesito aun m치s texto, as칤 que sigamos escribiendo. No se me ocurren m치s cosas para escribir. As칤 que esto es todo por ahora. Esta es una descripci칩n de prueba. Quiero escribir una descripci칩n muy larga para ver c칩mo se ve en la p치gina. As칤 que estoy escribiendo mucho texto para ver c칩mo se ve en la p치gina. Espero que todo esto se vea bien. Necesito aun m치s texto, as칤 que sigamos escribiendo. No se me ocurren m치s cosas para escribir. As칤 que esto es todo por ahora.",
                "en": "This is a test description. I want to write a very long description to see how it looks on the page. So I am writing a lot of text to see how it looks on the page. I hope all this looks good. I need even more text, so let's keep writing. I can't think of anything else to write. So this is it for now. This is a test description. I want to write a very long description to see how it looks on the page. So I am writing a lot of text to see how it looks on the page. I hope all this looks good. I need even more text, so let's keep writing. I can't think of anything else to write. So this is it for now. This is a test description. I want to write a very long description to see how it looks on the page. So I am writing a lot of text to see how it looks on the page. I hope all this looks good. I need even more text, so let's keep writing. I can't think of anything else to write. So this is it for now. This is a test description. I want to write a very long description to see how it looks on the page. So I am writing a lot of text to see how it looks on the page. I hope all this looks good. I need even more text, so let's keep writing. I can't think of anything else to write. So this is it for now.",
                "pt": "Esta 칠 uma descri칞칚o de teste. Quero escrever uma descri칞칚o muito longa para ver como ela fica na p치gina. Ent칚o estou escrevendo muito texto para ver como fica na p치gina. Espero que tudo isso fique bom. Preciso de ainda mais texto, ent칚o vamos continuar escrevendo. N칚o consigo pensar em mais nada para escrever. Ent칚o 칠 isso por enquanto. Esta 칠 uma descri칞칚o de teste. Quero escrever uma descri칞칚o muito longa para ver como ela fica na p치gina. Ent칚o estou escrevendo muito texto para ver como fica na p치gina. Espero que tudo isso fique bom. Preciso de ainda mais texto, ent칚o vamos continuar escrevendo. N칚o consigo pensar em mais nada para escrever. Ent칚o 칠 isso por enquanto. Esta 칠 uma descri칞칚o de teste. Quero escrever uma descri칞칚o muito longa para ver como ela fica na p치gina. Ent칚o estou escrevendo muito texto para ver como fica na p치gina. Espero que tudo isso fique bom. Preciso de ainda mais texto, ent칚o vamos continuar escrevendo. N칚o consigo pensar em mais nada para escrever. Ent칚o 칠 isso por enquanto. Esta 칠 uma descri칞칚o de teste. Quero escrever uma descri칞칚o muito longa para ver como ela fica na p치gina. Ent칚o estou escrevendo muito texto para ver como fica na p치gina. Espero que tudo isso fique bom. Preciso de ainda mais texto, ent칚o vamos continuar escrevendo. N칚o consigo pensar em mais nada para escrever. Ent칚o 칠 isso por enquanto."
            },
            "image_path": {
                "es": "/images/alfred.webp",
                "en": "/images/alfred.webp",
                "pt": "/images/alfred.webp"
            },
            "image_hover_path": {
                "es": "/images/tarjeta-de-video.webp",
                "en": "/images/tarjeta-de-video.webp",
                "pt": "/images/tarjeta-de-video.webp"
            },
            "post_link": {
                "es": "/test",
                "en": "/en/test",
                "pt": "/pt-br/test"
            }
        },
        "post3": {
            "title": {
                "es": "Introducci칩n a Python",
                "en": "Python introduction",
                "pt": "Introdu칞칚o ao Python"
            },
            "description": {
                "es": "Python 游냀 es uno de los lenguajes de programaci칩n 游눹 M츼S USADO. Entra y aprende todo lo que necesitas sobre Python 游냀",
                "en": "Python 游냀 is one of the programming languages 游눹 MOST USED. Enter and learn everything you need about Python 游냀",
                "pt": "Python 游냀 칠 uma das linguagens de programa칞칚o 游눹 MAIS USADAS. Entre e aprenda tudo o que voc칡 precisa sobre Python 游냀"
            },
            "image_path": {
                "es": "/images/icon-python.webp",
                "en": "/images/icon-python.webp",
                "pt": "/images/icon-python.webp"
            },
            "image_hover_path": {
                "es": "",
                "en": "",
                "pt": ""
            },
            "post_link": {
                "es": "/python",
                "en": "/en/python",
                "pt": "/pt-br/python"
            }
        }
    }
}